000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОтложенныеДвиженияДокументов/ОтложенныеДвиженияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеДвиженияДокументов</name>
  <resources>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоНеудачныхПроведений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СообщениеОбОшибкеПроведения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОтложенныеДвиженияДокументов/ManagerModule.bsl
Процедура НазначитьОтложенноеПроведение(ДокументСсылка, ДатаДокумента = '00010101')	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ДатаДокумента = '00010101' Тогда

		ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата");

	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ         = ДокументСсылка;
	МенеджерЗаписи.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов();

	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Документ = Неопределено Тогда

		МенеджерЗаписи.Документ         = ДокументСсылка;
		МенеджерЗаписи.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов();
		МенеджерЗаписи.ДатаДокумента    = ДатаДокумента;

		МенеджерЗаписи.Записать(Истина);

	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
